app/views/bookings/index.html.erb

SELECT  "tours".* FROM "tours" WHERE "tours"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT  "tours".* FROM "tours" WHERE "tours"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
                <%= booking.tour.title %></li>
                <% if booking.tour.tour_days.present? %>
              <li>
                  <%= booking.tour.tour_days.size %>