app/views/tours/index.html.erb

                <td>
                  <% if tour.tour_days.present? %>
                  <%= tour.tour_days.size %> days
---
SELECT "tours".* FROM "tours"
SELECT "tour_days".* FROM "tour_days" WHERE "tour_days"."tour_id" = $1  [["tour_id", 1]]
SELECT COUNT(*) FROM "tour_days" WHERE "tour_days"."tour_id" = $1  [["tour_id", 1]]