app/views/tours/show.html.erb

          <h2 class="text-white text-center">
            <% if @tour.tour_days.present? %>
              <%= @tour.tour_days.size %>
---
SELECT "tour_days".* FROM "tour_days" WHERE "tour_days"."tour_id" = $1  [["tour_id", 4]]
SELECT  "tour_days".* FROM "tour_days" WHERE "tour_days"."tour_id" = $1 ORDER BY "tour_days"."id" ASC LIMIT $2  [["tour_id", 1], ["LIMIT", 1]]
SELECT COUNT(*) FROM "tour_days" WHERE "tour_days"."tour_id" = $1  [["tour_id", 1]]

      <div class="row db-dark">
        <% @tour.tour_days.each do |day|%>
---
SELECT "tour_days".* FROM "tour_days" WHERE "tour_days"."tour_id" = $1  [["tour_id", 2]]