app/controllers/administrator_session_controller.rb

SELECT  "administrators".* FROM "administrators" WHERE "administrators"."email" = $1 LIMIT $2  [["email", "bob-smith@example.com"], ["LIMIT", 1]]
---
  def create

    administrator = Administrator.find_by :email => params[:email]