app/controllers/pages_controller.rb

  def index
    @tours = Tour.all
---
SELECT  "tours".* FROM "tours" ORDER BY "tours"."id" ASC LIMIT $1 OFFSET $2  [["LIMIT", 1], ["OFFSET", 1]]