app/controllers/session_controller.rb

  def create

    customer = Customer.find_by :email => params[:email]
---
SELECT  "customers".* FROM "customers" WHERE "customers"."email" = $1 LIMIT $2  [["email", "bob-smith@example.com"], ["LIMIT", 1]]