app/controllers/tours_controller.rb

  def index
    @tours = Tour.all
---
SELECT "tours".* FROM "tours"

  def show
   @tour = Tour.find params[:id]
---
SELECT  "tours".* FROM "tours" WHERE "tours"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]